#define _CRT_SECURE_NO_WARNINGS 1
//操作符详解(2)
# include <stdio.h>

 //算术转换：类型大小大于int 的
int  main(){

	return 0;
}

//整型提升举例
int main(){
	//c只要参与表达式运算，就会发生整型提升，表达式 +c 就会发生提升，所以sizeof(+c)是4个字节
	//表达式 -c 也会发生整型提升，所以sizeof(-c) 是4个字节，
	//但是sizeof(c)是一个字节
	char c = 1;
	printf("%u\n",sizeof(c));	  //1
	printf("%u\n",sizeof(+c));	  // 操作符 + - 则+4 是一个表达式，则会发生整型提升 4
	printf("%u\n",sizeof(-c));	  //4
	return 0;
}

//int main(){
//	char a = 0xb6;	              //1011 0110
//	short b = 0xb600;			 //1011 0110 0000 0000
//	int c = 0xb6000000;			 //1011 0110 0000 0000 0000 0000 0000 0000
//	if (a == 0xb6){
//		printf("a");
//	}
//	if (b == 0xb600){
//		printf("b");
//	}
//	if (c == 0xb6000000){
//		printf("c");		//程序的输出结果为：c
//	}
//	return 0;
//}


//表达式求值：表达式求值的顺序一部分是由操作符的优先级和结合性决定
//同样，有些表达式的操作数在求值的过程中可能需要转换为其它类型
/**隐式类型转换：C的整型算术运算总是至少以缺省整型类型的精度来进行的
为了获得这个精度，表达式中的字符和短整型操作数在使用之前被转换为普通整型，这种转换称为整型提升
整型提升的意义:表达式的整型运算在CPU的相应运算器件内执行，CPU内整型运算器(ALU)的操作数的字节长度
一般就是int的字节长度，同时也是CPU的通用寄存器的长度。
因此，及时两个char类型的相加，在CPU执行时实际上也要先转换为CPU内整型操作数的标准长度。
通用CPU(general-purpose CPU)是难以直接实现两个8比特字节直接相加运算(虽然机器指令中可能有这种字节相加指令)。
所以，表达式中各种长度可能小于int长度的整型值，都必须先转换为int或unsigned int，然后才能送入CPU去执行运算
//整型提升是按照变量的数据类型的符号位来提升的
*/
//负数的整型提升：
/*
char c1 = -1;
变量c1的二进制位(补码)中只有8个比特位：
	  1111111
	  因为 char 为有符号的 char
	  所以整型提升的时候，高位补充符号位，即为1
	  提升之后的结果是：
	  11111111 11111111 11111111 11111111 

*/
/**
int main(){
	//                             00000011
	//a:                           00000000 00000000 00000000 00000011
	//a发生整型提升的结果为：	   00000000 00000000 00000000 00000011

	//							   01111111
	//b:                           00000000 00000000 00000000 01111111
	//b 发生整型提升之后：		   00000000 00000000 00000000 01111111

	//char c = a + b的结果：	   00000000 00000000 00000000 10000010
	// c:                          10000010
	//c提升后的结果为：            11111111 11111111 11111111 10000010	——补码
	//                             11111111 11111111 11111111 10000001 ——反码
	//                             10000000 00000000 00000000 01111110——原码：即-126

	char a = 3;
	char b = 127;
	char c = a + b;
	//a和b要发生整型提升
	//a和b的值被提升为普通整型，然后在执行加法运算，加法运算完成之后，结果将被截断，然后再存储于c中
	printf("c = %d\n",c);	  //c = -126
	//a和b 要发生整型提升：
	//整型提升是按照变量的数据类型的符号位来提升的
	//
	return 0;
}
*/

//  访问一个结构的成员
//   .  结构体.成员
//  ->   结构体指针 -> 成员名
//struct Book{
//	char name[20];
//	int price;
//
//};
//int main(){
//	struct Book b = { "C语言程序设计",30 };
//	//结构体变量.成员变量
//	printf("书名= %s,价格为：%d\n",b.name,b.price);
//
//	struct Book *pb = &b;
//	//结构体指针 ->成员变量
//	printf("书名：%s,价格为：%d\n",pb ->name,pb-> price);
//	return 0;
//}

//()函数调用操作符： 接受一个或多个操作数：第一个擦偶偶书是函数名，剩余的操作数就是传递给函数的参数
//void test(){
//
//	printf("test\n");
//}
//int main(){
//	printf("jijixiong\n");		//()函数调用操作符
//	test();
//	return 0;
//}
//数组是首元素地址
//int main(){
//	int arr[10] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };
//	//arr + 4
//	printf("%p\n", arr + 4);				  //004FFC54
//	printf("%p\n",&arr[4]);//%p是打印地址   //004FFC54
//	printf("%d\n",*(arr + 4));				   //5
//	printf("%d\n",arr[4]);	   //5
//	printf("%d\n",4[arr]);//5
	 //  *(arr + 4) == arr[4];
	//  *(4 + arr) == 4arr[];
//	return 0;
//
//}
//[]下标引用操作符
//操作数：一个数组名+ 一个索引值
//int main(){
//	int arr[10];//创建数组
//	arr[9] = 10;//使用下标引用操作符	   ：[]的两个操作数是arr和9
//	printf("%d\n",arr[9]);		//arr[9] = 10
//	return 0;
//}

//逗号表达式:就是用逗号隔开的多个表达式，
//逗号表达式从左到右依次执行。整个表达式的结果是最后一个表达式的结果。
// exp1,exp2,exp3,3xp4....expN
//int main(){
//	int a = 1;
//	int b = 2;
//	int c = (a > b,a = b + 10,a ,b = a + 1);
//	printf("c = %d\n", c);//a = 12,b = 13,c = 13
//	return 0;
//}
//条件表达式exp1 ? exp2 : exp3
//int main(){
//	int a = 10;
//	int b = 20;
//	int max = 0;
//	max = a > b ? a : b;
//	/*if (a > b){
//		max = a;
//	}
//	else
//		max = b;*/
//	printf("两数之间的较大值为：%d\n",max);
//	return 0;
//}
//int main(){
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	//i = a++ && ++b && d++;		  //a = 1,b = 2,c = 3,d = 4
//	i = a++ || ++b || d++;	   //a = 1,b = 3,c = 3,d = 4
//	printf("a = %d\n,b = %d\n,c = %d\n,d = %d\n",a,b ,c ,d);
//	return 0;
//}

//int main(){
//	int age = 0;
//	printf("请输入您的年龄：\n");
//	scanf("%d",&age);
//	if (age >= 18 && age <= 40){
//	/*if (18 <= age <= 40) {*/
//		printf("成年\n");
//	}
//	if (age , 18 || age >= 40){
//		printf("不是未成年！\n");
//	}
//	return 0;
//}

//逻辑操作符：&& 逻辑与 || 逻辑或
//
//int main(){
//	int a = 3;
//	int b = 5;
	//a & b; //按(二进制位)位与
	//a && b;		//逻辑与
	/*int c = a && b;
	printf("c = %d\n",c);*/	   //c = 1

//	int c = a || b;
//	printf("c = %d\n",c);		  //c = 1
//	return  0;
//}

//关系操作符：>   >=   <   <=   !=   ==

//强制类型转换()
//int main(){
//	int a = (int)3.14;
//	printf("%d", a);
//	return 0;
//}

//自增操作符 ++ :先使用，再++
//自减操作符 --
//int main(){
//	int a = 10;
	//int b = a++;//后置++，先使用a的值，再给a自增1
	//printf("a = %d,b = %d",a,b);			//10  11

	//int b = ++a;   //前置++，先给a自增1，再使用a
	//printf("a = %d,b = %d",a,b);		 //a = 11 b = 11

	/*int b = a--;
	printf("a = %d, b = %d",a ,b);*/

	/*int b = --a;
	printf("a = %d,b = %d",a,b);*/

	
//	printf("a = %d",a++);			//a = 10
//	printf("a = %d", ++a);          //a = 11
//	return 0;
//}